app/controllers/tweets_controller.rb

SELECT * FROM "tweets"
---
  def index
    @tweets = Tweet.all

SELECT * FROM "tweets" WHERE ("tweets"."id" = 1)
---
  def show
    @tweet = Tweet.find(params[:id])

SELECT * FROM "tweets" WHERE ("tweets"."id" = 1)
---
  def edit
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("created_at", "user_id", "tweet", "updated_at") VALUES('2021-08-10 09:25:09', 3, 'This is a user generated tweet.', '2021-08-10 09:25:09')
---
  def create
    #@tweet = Tweet.new(params[:tweet])
    @tweet = current_user.tweets.build(params[:tweet])

    respond_to do |format|
      if @tweet.save

SELECT * FROM "tweets" WHERE ("tweets"."id" = 2)
DELETE FROM "tweets" WHERE "id" = 2
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy